{
    "sights" : [
        {
            "id": 1,
            "title": "Torre dos Clérigos",
            "image": "https://www.planetware.com/photos-large/P/portugal-oporto-torre-dos-clerigos.jpg",
            "description": "The soaring Clérigos Tower punctuates Porto's skyline like a monumental needle.",
            "more": "The soaring Clérigos Tower punctuates Porto's skyline like a monumental needle. This is the city's most visible landmark, a 75-meter-tall, 18th-century granite-hewn rocket, and visiting this historic structure should be high up on the 'things to do' list. You'll need a stout pair of legs to climb the 240 steps to the top of the tower, but the effort will be rewarded with a breathtaking panorama of the river, the coastline, and the distant Douro valley — a bird's-eye-view of Portugal's second largest city, and an inspiring way for first-time sightseers to get their bearings. Commissioned by the Brotherhood of the Clergy (clérigos) and designed by the Italian-born Nicolau Nasoni, the Baroque tower complements the adjoining Igreja dos Clérigos, which is also Nasoni's handiwork. Built between 1732 and 1750, the church itself is a wonderful example of the architect's affinity with the Baroque and features an elliptic floorplan, one of the first churches in Portugal built in such a way.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d6993.170414523526!2d-8.615493589436683!3d41.142180217646455!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd2464e251ced649%3A0x70c16361c3de59f0!2sIgreja%20dos%20Cl%C3%A9rigos!5e0!3m2!1sen!2sde!4v1621275600342!5m2!1sen!2sde"
        },
        {
            "id": 2,
            "title": "Ponte Dom Luís I",
            "image": "https://images.unsplash.com/photo-1569959220744-ff553533f492?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=745&q=80",
            "description": "The grandiose Dom Luís I bridge is one of the most iconic structures in Portugal.",
            "more": "The grandiose Dom Luís I bridge is one of the most iconic structures in Portugal. Spanning the mighty River Douro to link Porto with Vila Nova de Gaia on the south bank, the bridge's majestic sweep and two-tier aspect is a binding component in the city's proud, social fabric. The heavily riveted charcoal-grey ironwork has Gustave Eiffel written all over it, and indeed it was an assistant of the great French engineer who built the bridge in 1886. Commuters use the bridge on a daily basis — a road, Avenida da República, runs across the lower deck while the upper span accommodates a metro railway line. Pedestrians can walk across using the narrow pavements set either side of the road, or be really brave and traverse the structure using the 60-meter-high top-tier footpath.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d6009.488217635424!2d-8.615171724354898!3d41.140111791122486!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd2464e75cfd46d3%3A0xc25b40cf99456aab!2sLu%C3%ADs%20I%20Bridge!5e0!3m2!1sen!2sde!4v1621276432844!5m2!1sen!2sde"
        },
        {
            "id": 3,
            "title": "Palácio da Bolsa",
            "image": "https://www.planetware.com/photos-large/P/portugal-oporto-palacio-da-bolsa.jpg",
            "description": "Dating from the mid-19th century, Porto's former stock exchange.",
            "more": "Dating from the mid-19th century, Porto's former stock exchange contains a wealth of historic interest. Built on the site of a Franciscan monastery, its sumptuous interior is divided into several rooms and salons, each one singular in its appeal and worthy of close scrutiny. Pretend you're a wealthy merchant visiting on business as you wander through the Portrait Room with its gallery of uniformed monarchs, and then cast your eyes skywards after entering the Golden Room to admire its gilded stucco ceiling. You'll be ready for your meeting with the boss in the lavishly furnished Chairman's Room before joining fellow merchants in the richly decorated Court Hearing Room to witness mercantile law acted out in due process.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d6009.488217635424!2d-8.615171724354898!3d41.140111791122486!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0x69324171e40cd951!2sBolsa%20Palace!5e0!3m2!1sen!2sde!4v1621276512506!5m2!1sen!2sde"
        },
        {
            "id": 4,
            "title": "Cais da Ribeira",
            "image": "https://www.planetware.com/photos-large/P/portugal-oporto-cais-da-ribeira.jpg",
            "description": "Porto's riverside quarter is an alluring labyrinth of narrow, winding streets.",
            "more": "Porto's riverside quarter is an alluring labyrinth of narrow, winding streets; zigzagging alleyways; and low-slung, sun-starved arcades. Facing the River Douro, though, are terraces of lofty townhouses painted in bright mustard, tangerine, and tawny hues — the Ribeira is an adventure in color and flavor. A plethora of restaurants and cafés set under the arches along the quayside makes this the most popular area in the city for relaxing and socializing. Praça da Ribeira, the riverfront square, is a popular and lively meeting point and buzzes with a young, friendly vibe.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d4311.105347150978!2d-8.612656686247476!3d41.14091322916905!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd2464e0c8cbfb51%3A0xdffdd074ee6ba7be!2sCais%20da%20Ribeira%2C%20Porto%2C%20Portugal!5e0!3m2!1sen!2sde!4v1621276677587!5m2!1sen!2sde"
        },
        {
            "id": 5,
            "title": "Vila Nova de Gaia",
            "image": "https://www.planetware.com/photos-large/P/portugal-oporto-vila-nova-de-gaia.jpg",
            "description": "With its long, broad promenade and riverfront aspect, Vila Nova de Gaia is an irresistible diversion.",
            "more": "With its long, broad promenade and riverfront aspect, Vila Nova de Gaia is an irresistible diversion. Easily reached on foot by crossing the Ponte de Dom Luís I, the town's landscaped quayside is fringed by a long line of stylish restaurants and cafés. It's also the departure point for numerous Douro River cruise boats. Adding a wonderfully nostalgic perspective is the fleet of traditional barcos rabelos moored alongside the esplanade. These graceful sailing vessels were once used to ferry casks downriver from the Douro port estates, and with Porto's Ribeira district providing a suitably romantic backdrop, sightseers are regaled with an atmospheric cityscape, a tableaux reminiscent of the 18th century. For a truly dramatic outlook, take a ride on the Teleférico de Gaia, or cable car. This novel new sightseeing attraction runs along the Gaia riverside and connects the upper station, near the Mosteiro da Serra do Pilar, with the eastern end of the esplanade.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d13590.281462492614!2d-8.618033442155657!3d41.13202333555579!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd246527744036f1%3A0x677d50cf52addd75!2sVila%20Nova%20de%20Gaia%2C%20Portugal!5e0!3m2!1sen!2sde!4v1621276802433!5m2!1sen!2sde"
        },
        {
            "id": 6,
            "title": "Igreja do Carmo",
            "image": "https://www.planetware.com/photos-large/P/portugal-oporto-igreja-do-carmo.jpg",
            "description": "Plastering the exterior of Porto's 18th-century Carmo church is a blaze of blue and white azulejos (tiles).",
            "more": "Plastering the exterior of Porto's 18th-century Carmo church is a blaze of blue and white azulejos (tiles), and the striking façade is one of the most instantly recognized in the city. The immense panel is a real head turner, but the splendid gilt carvings that decorate the interior are equally appealing. In fact, the elegant golden-brushed woodwork is among the finest examples of Portuguese Rococo. The neighboring Igreja das Carmelitas is less of an eye-opener. Incredibly, dividing both is a house, built to comply with an ancient law that stipulated that no two churches were to share the same wall. Many believe this to be the narrowest private residence in the country, although it's been unoccupied for nearly 30 years. A whimsical anomaly, the one-meter-wide abode makes for an interesting snapshot squeezed as it is between two granite monoliths.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d10630.11121686516!2d-8.623416779336413!3d41.143473174653984!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd2464e2992d6fc9%3A0x14e81d436806274!2sIgreja%20do%20Carmo!5e0!3m2!1sen!2sde!4v1621276888480!5m2!1sen!2sde"
        },
        {
            "id": 7,
            "title": "Porto Tram City Tour",
            "image": "https://www.planetware.com/photos-large/P/portugal-porto-historical-tram.jpg",
            "description": "Porto's historic center and the riverfront can be admired from a vintage tram.",
            "more": "Porto's historic center and the riverfront can be admired from a vintage tram during tours that take in several emblematic sights and cultural landmarks. Three different lines serve the destination, all offering a different perspective on Portugal's second city. Line 1 begins near Ponte Dom Luís 1. Depart from here on the 'Riverside Line' to trundle west all the way to the coastal town of Foz do Douro, situated at the mouth of the River Douro and known for its nearby beaches and coves. This leisurely excursion is a favorite option in summer, when you want to escape the city heat. Line 18 is restored track, part circular in design and the shortest ride. The route passes Igreja do Carmo and ends, suitably, at the Museu do Carro Eléctrico, the tram museum. Arguably the most rewarding circuit in terms of sightseeing and attractions is the Line 22 tour. On this route, the streetcar clatters and hisses past Torre dos Clérigos, Igreja do Carmo, and Café Majestic, among other visual showstoppers.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d8622.025609510625!2d-8.619636278912754!3d41.14232105558182!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0xa06ce0b6e9ddf929!2sPr.%20da%20Liberdade!5e0!3m2!1sen!2sde!4v1621278851495!5m2!1sen!2sde"
        },
        {
            "id": 8,
            "title": "Avenida dos Aliados",
            "image": "https://www.planetware.com/photos-large/P/portugal-oporto-avenida-dos-aliados.jpg",
            "description": "A vibrant overview of everyday Porto can be gleaned by strolling the length of this broad double avenue.",
            "more": "A vibrant overview of everyday Porto can be gleaned by strolling the length of this broad double avenue. Lined both sides with shops, stores, boutiques, cafés, and restaurants, 'Aliados' is the city's clamorous commercial hub. At the foot of the thoroughfare lies Praça da Liberdade, but visitors can begin exploring by popping into the nearby Estação de São Bento, Porto's central railway station, to gaze upon the 20,000 or so dazzling azulejos depicting early modes of transport and the history of Portugal. A slow amble north will take you to the Câmera Municipal, Porto's city hall, which crowns the top of the avenue. From here, turn right along Rua Formosa until you reach the site of the historic Mercado do Bolhão.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d8874.169320706347!2d-8.621647261350343!3d41.14602080915209!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd2464e35940fd8f%3A0x738dcce6546dd210!2sAv.%20dos%20Aliados%2C%20Porto%2C%20Portugal!5e0!3m2!1sen!2sde!4v1621277042615!5m2!1sen!2sde"
        },
        {
            "id": 9,
            "title": "Sé (Cathedral)",
            "image": "https://www.planetware.com/photos-large/P/portugal-oporto-se-cathedral.jpg",
            "description": "Sightseeing in Porto should always include exploration of the city's cathedral.",
            "more": "Sightseeing in Porto should always include exploration of the city's cathedral. In fact, the sweeping panorama from the terrace over the old-town streets and the sleepy River Douro is a great curtain raiser and primes the senses for what lies ahead. An imposing 12th-century landmark, the cathedral has the appearance of a fortress, such is the forbidding look of its towers and the shadowy complexion of its façade. Redeeming features include a beautiful 13th-century rose window set in the west front, and the serene Baroque cloisters paneled with sky blue azulejo tiles. Linger here a little to absorb the medieval ambiance and the tranquil locale. From here, a worn 18th-century granite staircase connects with the chapterhouse, which is wrapped in more stunning tile work. Another standout attraction is the magnificent silver retable in the small chapel to the left of the chancel. Round off your tour by poring over the cathedral's dazzling hoard of gold and silver held in the Treasury.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d7409.027060925475!2d-8.620797031695279!3d41.14198988656632!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd2464e13991ebb9%3A0x4a1cccaea07537e9!2sPorto%20Cathedral!5e0!3m2!1sen!2sde!4v1621277116882!5m2!1sen!2sde"
        },
        {
            "id": 10,
            "title": "Igreja de São Francisco",
            "image": "https://www.planetware.com/photos-large/P/portugal-oporto-igreja-de-sao-francisco.jpg",
            "description": "Visitors are shrouded by gold as they enter the beautiful church of St. Francis.",
            "more": "Visitors are shrouded by gold as they enter the beautiful church of St. Francis. Its 18th-century Baroque interior is encrusted with a gilded veneer so dazzling and exuberant that most agree this is one of the best examples of worked gold anywhere in the country. Indeed, this is a priceless sightseeing experience. Gilt carving embellishes the high altar, columns, and pillars, with barely a single patch of stone left visible. Look out for smiling cherubs and dour-faced monks as you edge towards the north wall and São Francisco's Tree of Jesse, a family tree in gilded and painted wood depicting Christ's genealogy. An extraordinary and beguiling artifact carved between 1718 and 1721, the tree boasts fine detail seen in the expressions of Jesus, Mary, and Joseph, and other figures, including King David, Solomon, and Jesse himself, which leaves onlookers speechless. A tour of the ancient catacombs underneath the church helps bring visitors back down to earth, but there are more treasures from the church's monastery to behold in the museum afterwards.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d6185.463436208471!2d-8.619373596036692!3d41.14134234509975!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0xcae5f5a2cd96956c!2sMonument%20Church%20Of%20St%20Francis!5e0!3m2!1sen!2sde!4v1621277197631!5m2!1sen!2sde"
        },
        {
            "id": 11,
            "title": "Arrábida Bridge",
            "image": "https://www.planetware.com/wpimages/2020/04/portugal-porto-top-attractions-porto-bridge-climb.jpg",
            "description": "One of the more unusual things to do in Porto — is the chance to climb the arches of the Arrábida Bridge.",
            "more": "One of the more unusual things to do in Porto — and certainly a radical departure from the traditional sightseeing options — is the chance to climb the arches of the Arrábida Bridge, set downstream away from the more familiar Ponte Dom Luís 1. The Porto Bridge Climb conducts guided tours of this iconic structure with participants attired in harness and secure lifeline in order to scale the lofty heights safely and comfortably. Following a narrow pedestrian staircase and connected by cable to a parallel handrail, visitors slowly scale the yawning arches to reach the top of the span, 65 meters above the River Douro. The panoramic views of the outlying city and the mouth of the river are truly memorable. Descending the 262 steps reveals the size and elegance of this 20th-century engineering marvel, inaugurated in 1963 and currently the only bridge span in Europe that can be accessed this way.",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d18267.845413821473!2d-8.631241021125055!3d41.148026333837706!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0xc37d473fc76afe34!2sPonte%20da%20Arr%C3%A1bida!5e0!3m2!1sen!2sde!4v1621277331254!5m2!1sen!2sde"
        },
        {
            "id": 12,
            "title": "Café Majestic",
            "image": "https://www.planetware.com/photos-large/P/portugal-oporto-cafe-majestic.jpg",
            "description": "With its Art Nouveau façade of curvaceous stonework, this gem of a coffeehouse is unmistakable.",
            "more": "With its distinctive Art Nouveau façade of curvaceous stonework and undulating motifs, this sparkling gem of a coffeehouse is unmistakable. Inside, a vintage 1920s' ambience percolates the salon. Arranged throughout the lavish interior are the original carved wood chairs and marble-topped tables that lend Majestic its delightfully bohemian flavor. Cherubs and lamplights cling to the plasterwork ceiling. Gracing the walls are sets of huge Flemish mirrors that reflect the evocative, yesteryear character. This is the most celebrated of Porto's cafés, and one of Europe's most historical. Lunch and dinner can be taken here in considerable style, the menu tempting with a fusion of Portuguese and Mediterranean flavors. The café is also known for its cakes and pastries selection, and conjures up specialties like French toast smothered in a creamy egg custard topped with dried fruit. Kids will love it here, especially when they realize that author J.K. Rowling worked on the draft of her first book Harry Potter and the Philosopher's Stone while sipping coffee at a table near the entrance. Magic, or what?",
            "map": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d10629.943572633008!2d-8.62038689417426!3d41.144507388321266!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd2464e5a52a2493%3A0x1dc3afde71cae5f4!2sMajestic%20Caf%C3%A9!5e0!3m2!1sen!2sde!4v1621277389951!5m2!1sen!2sde"
        }
    ]
}